Tekla Open API Reference for Tekla Structures 2025
PointPlacing Methods
The PointPlacing type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides PlacingBase.IsEqual(Object).)
Top
See Also
Reference
PointPlacing Class
Tekla.Structures.Drawing Namespace